project/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-01-29 01:31:20.615619"], ["updated_at", "2019-01-29 01:31:20.615619"]]
---
    def create
        debugger
        user = User.new
        if user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def destroy
        user = User.find(params[:id]).destroy